//===-- fbx.h ---------------------------------------------*- mode: C99 -*-===//
//
//                           _____ _____ __ __
//                          |   __| __  |  |  |
//                          |   __| __ -|-   -|
//                          |__|  |_____|__|__|
//
//   The contents of this of this file is released into the public domain.
//
//===----------------------------------------------------------------------===//

#ifndef _FBX_H_
#define _FBX_H_

#if defined(_MSC_VER)
  #define FBX_ON_MSVC  1
  #define FBX_ON_CLANG 0
  #define FBX_ON_GCC   0
#elif defined(__GNUC__)
  #if defined(__clang__)
    #define FBX_ON_MSVC  0
    #define FBX_ON_CLANG 1
    #define FBX_ON_GCC   1
  #else
    /* HACK(mtwilliams): We assume that we're being compiled with GCC. */
    #define FBX_ON_MSVC  0
    #define FBX_ON_CLANG 0
    #define FBX_ON_GCC   1
  #endif
#endif

#if defined(_WIN32) || defined(_WIN64)
  #define FBX_ON_WINDOWS 1
  #define FBX_ON_MAC 0
  #define FBX_ON_LINUX 0
  #define FBX_ON_ANDROID 0
  #define FBX_ON_IOS 0
#elif defined(__APPLE__)
  #include <TargetConditionals.h>
  #if TARGET_OS_MAC
    #define FBX_ON_WINDOWS 0
    #define FBX_ON_MAC 1
    #define FBX_ON_LINUX 0
    #define FBX_ON_ANDROID 0
    #define FBX_ON_IOS 0
  #elif TARGET_OS_IPHONE || TARGET_IPHONE_SIMULATOR
    #define FBX_ON_WINDOWS 0
    #define FBX_ON_MAC 0
    #define FBX_ON_LINUX 0
    #define FBX_ON_ANDROID 0
    #define FBX_ON_IOS 1
  #elif TARGET_OS_TVOS

    #define FBX_ON_MAC 0
    #define FBX_ON_LINUX 0
    #define FBX_ON_ANDROID 1
    #define FBX_ON_IOS 0
  #else
    #define FBX_ON_WINDOWS 0
    #define FBX_ON_MAC 0
    #define FBX_ON_LINUX 1
    #define FBX_ON_ANDROID 0
    #define FBX_ON_IOS 0
  #endif
#else
  #error ("We don't support this platform!")
#endif

#if FBX_ON_WINDOWS
  #define FBX_ON_POSIX 0
#elif FBX_ON_MAC || FBX_ON_LINUX
  #define FBX_ON_POSIX 1
#elif FBX_ON_ANDROID || FBX_ON_IOS
  /* Ostensibly... */
  #define FBX_ON_POSIX 1
#endif

#if defined(_M_IX86) || defined(__i386__)
  #define FBX_ON_X86 1
  #define FBX_ON_X86_64 0
#elif defined(_M_X64) || defined(__x86_64__)
  #define FBX_ON_X86 0
  #define FBX_ON_X86_64 1
#endif

#if FBX_ON_WINDOWS
  #define FBX_EXPORT(Return) Return __stdcall
  #define FBX_CALLBACK(Return) Return __cdecl
#elif FBX_ON_MAC
  #define FBX_EXPORT(Return) Return
  #define FBX_CALLBACK(Return) Return
#elif FBX_ON_LINUX
  #define FBX_EXPORT(Return) Return
  #define FBX_CALLBACK(Return) Return
#elif FBX_ON_ANDROID
  #define FBX_EXPORT(Return) Return
  #define FBX_CALLBACK(Return) Return
#elif FBX_ON_IOS
  #define FBX_EXPORT(Return) Return
  #define FBX_CALLBACK(Return) Return
#endif

#if defined(__cplusplus)
  #define FBX_BEGIN_EXTERN_C extern "C" {
  #define FBX_END_EXTERN_C }
#else
  #define FBX_BEGIN_EXTERN_C
  #define FBX_END_EXTERN_C
#endif

FBX_BEGIN_EXTERN_C

typedef signed char    fbx_int8_t;
typedef unsigned char  fbx_uint8_t;
typedef signed short   fbx_int16_t;
typedef unsigned short fbx_uint16_t;
typedef signed int     fbx_int32_t;
typedef unsigned int   fbx_uint32_t;

#if defined(_MSC_VER)
  typedef signed __int64 fbx_int64_t;
  typedef unsigned __int64 fbx_uint64_t;
#else
  typedef signed long long fbx_int64_t;
  typedef unsigned long long fbx_uint64_t;
#endif

typedef float fbx_real32_t;
typedef double fbx_real64_t;

#if (_MSC_VER >= 1300 && _Wp64)
  #if FBX_ON_X86
    typedef __w64 signed long fbx_intptr_t;
    typedef __w64 unsigned long fbx_uintptr_t;
    typedef __w64 unsigned long fbx_size_t;
  #elif FBX_ON_X86_64
    typedef __w64 signed __int64 fbx_intptr_t;
    typedef __w64 unsigned __int64 fbx_uintptr_t;
    typedef __w64 unsigned __int64 fbx_size_t;
  #endif
#else
  #if FBX_ON_X86
    typedef fbx_int32_t fbx_intptr_t;
    typedef fbx_uint32_t fbx_uintptr_t;
    typedef fbx_uint32_t fbx_size_t;
  #elif FBX_ON_X86_64
    typedef fbx_int64_t fbx_intptr_t;
    typedef fbx_uint64_t fbx_uintptr_t;
    typedef fbx_uint64_t fbx_size_t;
  #endif
#endif

/* We (have to) define our own boolean type regardless of compiler support
   to prevent its width from being changed on us. */
typedef fbx_uint32_t fbx_bool_t;

#define FBX_TRUE  ((fbx_bool_t)1)
#define FBX_FALSE ((fbx_bool_t)0)

/* This will cause a negative subscript error if the sizes of our types don't
   match our expectations. */
#define FBX_CHECK_SIZE_OF_TYPE(expression) \
  typedef char fbx__size_matches_expectation[(expression) ? 1 : -1]

/* Ensure fixed-width types match our expectations. */
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_int8_t)   == 1);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_uint8_t)  == 1);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_int16_t)  == 2);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_uint16_t) == 2);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_int32_t)  == 4);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_uint32_t) == 4);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_int64_t)  == 8);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_uint64_t) == 8);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_real32_t) == 4);
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_real64_t) == 8);

/* Ensure pointer-width integer types can actually hold pointers. */
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_intptr_t) == sizeof(void *));
FBX_CHECK_SIZE_OF_TYPE(sizeof(fbx_uintptr_t) == sizeof(void *));

#undef FBX_CHECK_SIZE_OF_TYPE

/* TODO(mtwilliams): Free-standing. */

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>

/*  _____     ___     _
 * |   __|___|  _|___| |_ _ _
 * |__   | .'|  _| -_|  _| | |
 * |_____|__,|_| |___|_| |_  |
 *                       |___|
 */

typedef struct fbx_panic_info {
  /*! File where the panic occured. */
  const char *file;
  /*! Line in file where the panic occured. */
  unsigned line;
} fbx_panic_info_t;

typedef FBX_CALLBACK(void)
  fbx_panic_handler_fn(const char *reason,
                       const fbx_panic_info_t *info);

extern FBX_EXPORT(void)
  fbx_get_panic_handler(fbx_panic_handler_fn **handler);

extern FBX_EXPORT(void)
