//===-- wabisabi.h ----------------------------------------*- mode: C99 -*-===//
//
//                _       __      __    _            __    _
//               | |     / /___ _/ /_  (_)________ _/ /_  (_)
//               | | /| / / __ `/ __ \/ / ___/ __ `/ __ \/ /
//               | |/ |/ / /_/ / /_/ / (__  ) /_/ / /_/ / /
//               |__/|__/\__,_/_.___/_/____/\__,_/_.___/_/
//
//
//   The contents of this of this file is released into the public domain.
//
//===----------------------------------------------------------------------===//

#ifndef _WABISABI_H_
#define _WABISABI_H_

//  _____     _ _   _
// | __  |_ _|_| |_| |
// | __ -| | | | | . |
// |_____|___|_|_|___|

#if defined(_MSC_VER)
  #define WABISABI_ON_MSVC  1
  #define WABISABI_ON_CLANG 0
  #define WABISABI_ON_GCC   0
#elif defined(__GNUC__)
  #if defined(__clang__)
    #define WABISABI_ON_MSVC  0
    #define WABISABI_ON_CLANG 1
    #define WABISABI_ON_GCC   1
  #else
    // HACK(mtwilliams): We assume that we're being compiled with GCC.
    #define WABISABI_ON_MSVC  0
    #define WABISABI_ON_CLANG 0
    #define WABISABI_ON_GCC   1
  #endif
#endif

#if defined(_WIN32) || defined(_WIN64)
  #define WABISABI_ON_WINDOWS 1
  #define WABISABI_ON_MAC 0
  #define WABISABI_ON_LINUX 0
  #define WABISABI_ON_ANDROID 0
  #define WABISABI_ON_IOS 0
#elif defined(__APPLE__)
  #include <TargetConditionals.h>
  #if TARGET_OS_MAC
    #define WABISABI_ON_WINDOWS 0
    #define WABISABI_ON_MAC 1

  #define WABISABI_ON_POSIX 0
#elif WABISABI_ON_MAC || WABISABI_ON_LINUX
  #define WABISABI_ON_POSIX 1
#elif WABISABI_ON_ANDROID || WABISABI_ON_IOS
  // Ostensibly...
  #define WABISABI_ON_POSIX 1
#endif

#if defined(_M_IX86) || defined(__i386__)
  #define WABISABI_ON_X86 1
  #define WABISABI_ON_X86_64 0
#elif defined(_M_X64) || defined(__x86_64__)
  #define WABISABI_ON_X86 0
  #define WABISABI_ON_X86_64 1
#endif

#if WABISABI_ON_WINDOWS
  #define WABISABI_EXPORT(ret) ret __stdcall
  #define WABISABI_CALLBACK(ret) ret __cdecl
#elif WABISABI_ON_MAC
  #define WABISABI_EXPORT(ret) ret
  #define WABISABI_CALLBACK(ret) ret
#elif WABISABI_ON_LINUX
  #define WABISABI_EXPORT(ret) ret
  #define WABISABI_CALLBACK(ret) ret
#elif WABISABI_ON_ANDROID
  #define WABISABI_EXPORT(ret) ret
  #define WABISABI_CALLBACK(ret) ret
#elif WABISABI_ON_IOS
  #define WABISABI_EXPORT(ret) ret
  #define WABISABI_CALLBACK(ret) ret
#endif

#if defined(__cplusplus)
  #define WABISABI_BEGIN_EXTERN_C extern "C" {
  #define WABISABI_END_EXTERN_C }
#else
  #define WABISABI_BEGIN_EXTERN_C
  #define WABISABI_END_EXTERN_C
#endif

// If you define `WABISABI_SANE_COORDINATE_SYSTEM`, Wabisabi will configure
// OpenGL to use a right-handed coordinate system.
#ifdef WABISABI_SANE_COORDINATE_SYSTEM
  #if WABISABI_ON_MSVC
    #pragma message("Wabisabi will use a sane coodinate sytem.")
  #endif
#endif

//  _____
// |_   _|_ _ ___ ___ ___
//   | | | | | . | -_|_ -|
//   |_| |_  |  _|___|___|
//       |___|_|

WABISABI_BEGIN_EXTERN_C

typedef signed char    ws_int8_t;
typedef unsigned char  ws_uint8_t;
typedef signed short   ws_int16_t;
typedef unsigned short ws_uint16_t;
typedef signed int     ws_int32_t;
typedef unsigned int   ws_uint32_t;

#if defined(_MSC_VER)
  typedef signed __int64 ws_int64_t;
  typedef unsigned __int64 ws_uint64_t;
#else
  typedef signed long long ws_int64_t;
  typedef unsigned long long ws_uint64_t;
#endif

typedef float ws_real32_t;
typedef double ws_real64_t;

#if (_MSC_VER >= 1300 && _Wp64)
  #if WABISABI_ON_X86
    typedef __w64 signed long ws_intptr_t;
    typedef __w64 unsigned long ws_uintptr_t;
    typedef __w64 unsigned long ws_size_t;
  #elif WABISABI_ON_X86_64
    typedef __w64 signed __int64 ws_intptr_t;
    typedef __w64 unsigned __int64 ws_uintptr_t;
    typedef __w64 unsigned __int64 ws_size_t;
  #endif
#else
  #if WABISABI_ON_X86
    typedef ws_int32_t ws_intptr_t;
    typedef ws_uint32_t ws_uintptr_t;
    typedef ws_uint32_t ws_size_t;
  #elif WABISABI_ON_X86_64
    typedef ws_int64_t ws_intptr_t;
    typedef ws_uint64_t ws_uintptr_t;
    typedef ws_uint64_t ws_size_t;
  #endif
#endif

typedef unsigned int ws_bool_t;

#define WS_TRUE  ((ws_bool_t)1)
#define WS_FALSE ((ws_bool_t)0)

// This will cause negative subscript errors if the sizes of our types don't
// match our expectations.
#define WABISABI_CHECK_SIZE_OF_TYPE(expression) \
  typedef char ws__size_matches_expectation[(expression) ? 1 : -1]

// Ensure fixed width types match our expectations.
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_int8_t)   == 1);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_uint8_t)  == 1);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_int16_t)  == 2);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_uint16_t) == 2);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_int32_t)  == 4);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_uint32_t) == 4);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_int64_t)  == 8);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_uint64_t) == 8);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_real32_t) == 4);
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_real64_t) == 8);

// Ensure integer pointer types can actually hold pointers.
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_intptr_t) == sizeof(void *));
WABISABI_CHECK_SIZE_OF_TYPE(sizeof(ws_uintptr_t) == sizeof(void *));

#undef WABISABI_CHECK_SIZE_OF_TYPE

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>

//  _____     ___     _
// |   __|___|  _|___| |_ _ _
// |__   | .'|  _| -_|  _| | |
// |_____|__,|_| |___|_| |_  |
//                       |___|

// Called when something horrible happened. Hints as to what then bails.
extern void ws_panic(const char *format, ...);

//  _____
// |     |___ _____ ___ ___ _ _
// | | | | -_|     | . |  _| | |
// |_|_|_|___|_|_|_|___|_| |_  |
//                         |___|

extern void *ws_allocate(ws_size_t size,
                         ws_size_t alignment);

extern void *ws_allocate_s(ws_size_t size,
                           ws_size_t alignment);

extern void ws_free(void *ptr);

